In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],'k2':['alpha','beta','alpha','beta','alpha'],'dataset1':np.random.randn(5),'dataset2':np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.593323 -0.100970
1  X   beta -0.203319  0.663850
2  Y  alpha -1.211770 -0.088673
3  Y   beta -0.728628  1.643199
4  Z  alpha -0.587191  0.196691

In [4]:
l,t=2,5

In [5]:
m=[l,t,t,t,l]

In [6]:
m

[2, 5, 5, 5, 2]

In [7]:
dframe.dataset1

0   -1.593323
1   -0.203319
2   -1.211770
3   -0.728628
4   -0.587191
Name: dataset1, dtype: float64

In [8]:
dframe.iloc[0]

k1                 X
k2             alpha
dataset1   -1.593323
dataset2    -0.10097
Name: 0, dtype: object

In [9]:
dframe.iloc[[0,1]]

  k1     k2  dataset1  dataset2
0  X  alpha -1.593323  -0.10097
1  X   beta -0.203319   0.66385

In [10]:
dframe[['k1','k2']]

  k1     k2
0  X  alpha
1  X   beta
2  Y  alpha
3  Y   beta
4  Z  alpha

In [72]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [73]:
group1

In [74]:
group1.sum()

k1
X   -1.796642
Y   -1.940399
Z   -0.587191
Name: dataset1, dtype: float64

In [14]:
group1.mean()

k1
X   -0.898321
Y   -0.970199
Z   -0.587191
Name: dataset1, dtype: float64

In [15]:
group1.count()

k1
X    2
Y    2
Z    1
Name: dataset1, dtype: int64

In [16]:
group1.min()

k1
X   -1.593323
Y   -1.211770
Z   -0.587191
Name: dataset1, dtype: float64

In [17]:
group1.max()

k1
X   -0.203319
Y   -0.728628
Z   -0.587191
Name: dataset1, dtype: float64

In [18]:
group1.min

In [19]:
group1.max()

k1
X   -0.203319
Y   -0.728628
Z   -0.587191
Name: dataset1, dtype: float64

In [20]:
group1.corr()

TypeError: corr() missing 1 required positional argument: 'other'

In [21]:
cities =  np.array(['NY','LA','LA','NY','NY'])

In [22]:
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [36]:
dframe['dataset1'].groupby([cities,month]).sum()

LA  FEB   -0.203319
    JAN   -1.211770
NY  FEB   -0.728628
    JAN   -2.180514
Name: dataset1, dtype: float64

In [34]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.593323 -0.100970
1  X   beta -0.203319  0.663850
2  Y  alpha -1.211770 -0.088673
3  Y   beta -0.728628  1.643199
4  Z  alpha -0.587191  0.196691

In [38]:
dframe.groupby('k1').sum()

    dataset1  dataset2
k1
X  -1.796642  0.562880
Y  -1.940399  1.554525
Z  -0.587191  0.196691

In [40]:
dframe.groupby('dataset1').sum()

           dataset2
dataset1
-1.593323 -0.100970
-1.211770 -0.088673
-0.728628  1.643199
-0.587191  0.196691
-0.203319  0.663850

In [41]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -1.593323 -0.100970
1  X   beta -0.203319  0.663850
2  Y  alpha -1.211770 -0.088673
3  Y   beta -0.728628  1.643199
4  Z  alpha -0.587191  0.196691

In [44]:
dframe.groupby(['k1','k2']).sum()

          dataset1  dataset2
k1 k2
X  alpha -1.593323 -0.100970
   beta  -0.203319  0.663850
Y  alpha -1.211770 -0.088673
   beta  -0.728628  1.643199
Z  alpha -0.587191  0.196691

In [49]:
for name,group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -1.593323  -0.10097
1  X   beta -0.203319   0.66385


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.211770 -0.088673
3  Y   beta -0.728628  1.643199


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.587191  0.196691

In [55]:
for name,group in dframe.groupby('k2'):
    print(group)

  k1     k2  dataset1  dataset2
0  X  alpha -1.593323 -0.100970
2  Y  alpha -1.211770 -0.088673
4  Z  alpha -0.587191  0.196691
  k1    k2  dataset1  dataset2
1  X  beta -0.203319  0.663850
3  Y  beta -0.728628  1.643199

In [54]:
for (k1,k2),group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 %s"%(k1,k2))
    print(group)
    print('\n')

Key1 = X Key2 alpha
  k1     k2  dataset1  dataset2
0  X  alpha -1.593323  -0.10097


Key1 = X Key2 beta
  k1    k2  dataset1  dataset2
1  X  beta -0.203319   0.66385


Key1 = Y Key2 alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  -1.21177 -0.088673


Key1 = Y Key2 beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.728628  1.643199


Key1 = Z Key2 alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.587191  0.196691

In [56]:
group_dict = dict(list(dframe.groupby('k1')))

In [57]:
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha -1.593323  -0.10097
 1  X   beta -0.203319   0.66385,
 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha -1.211770 -0.088673
 3  Y   beta -0.728628  1.643199,
 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha -0.587191  0.196691}

In [58]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -1.593323  -0.10097
1  X   beta -0.203319   0.66385

In [59]:
t = Series(['a','b','c','d','e'])

In [60]:
t

0    a
1    b
2    c
3    d
4    e
dtype: object

In [62]:
te = t.to_dict()

In [63]:
te

{0: 'a', 1: 'b', 2: 'c', 3: 'd', 4: 'e'}

In [64]:
g = dframe.to_dict()

In [65]:
g

{'k1': {0: 'X', 1: 'X', 2: 'Y', 3: 'Y', 4: 'Z'},
 'k2': {0: 'alpha', 1: 'beta', 2: 'alpha', 3: 'beta', 4: 'alpha'},
 'dataset1': {0: -1.5933227302012904,
  1: -0.2033191027351788,
  2: -1.211770393469064,
  3: -0.7286281817767782,
  4: -0.5871911987441129},
 'dataset2': {0: -0.1009698086576828,
  1: 0.6638502146912646,
  2: -0.08867334784028538,
  3: 1.6431988352401825,
  4: 0.19669122282909549}}

In [66]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [67]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -1.593323 -0.100970
 1 -0.203319  0.663850
 2 -1.211770 -0.088673
 3 -0.728628  1.643199
 4 -0.587191  0.196691,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [78]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [79]:
dataset2_group

In [80]:
dataset2_group.sum()

          dataset2
k1 k2
X  alpha -0.100970
   beta   0.663850
Y  alpha -0.088673
   beta   1.643199
Z  alpha  0.196691